Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །མགོན་མེད་གྱུར་པ་རབ་ཏུ་གཟིགས་ནས་ནི།
en: Please look upon those who are masterless—

source: །ཤིན་ཏུ་ཐུགས་བརྩེར་མཛད་དེ་གཤེགས་པར་གསོལ།
en: Have compassion and come.”

source: དེ་ནས་མེ་ཏོག་དེ་རྣམས་སངས་རྒྱས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་མཐུ་དང་ལྷ་རྣམས་ཀྱི་ལྷའི་མཐུས་མེ་ཏོག་གི་ཁང་བཟངས་སུ་བྱས་ཏེ། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་རྒན་རིམས་བཞིན་གནས་པར་གྱུར་ཏོ།
en: Then the flowers, by the awakened power of the buddhas and the divine power of the gods, formed the shape of a flower pavilion, and that flower pavilion came to abide at the elders’ dwelling in the Jetavana.

source: །བདུག་པ་ནི་སྤྲིན་ལྟར་སྤུངས་སོ།
en: The smoke of the incense was woven together like a cloud.

source: །ཆུ་ནི་བཻ་ཌཱུརྱའི་ཕུར་མ་ལྟ་བུར་གྱུར་ཏོ།
en: The water assumed the shape of a lapis lazuli vessel.

source: །ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་མཚན་མ་ལ་མཁས་པ་ཡིན་པས་ཐལ་མོ་སྦྱར་བ་བྱས་ཏེ་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ་བཙུན་པ་སྤྱན་འདྲེན་པ་གང་ནས་མཆིས།
en: Since the venerable Ānanda was familiar with omens, he made the gesture of supplication and asked the Blessed One, “Honored One, where is this invitation from?”

source: ཀུན་དགའ་བོ་གྲོང་ཁྱེར་སློ་མ་ལྟ་བུ་ནས་སོ།
en: “From Sūrpāraka, Ānanda.”

source: བཙུན་པ་གྲོང་ཁྱེར་སློ་མ་ལྟ་བུར་ཇི་སྲིད་ཅིག་མཆིས།
en: “Honored One, how far is Sūrpāraka from here?”

source: ཀུན་དགའ་བོ་དཔག་ཚད་བརྒྱ་ལྷག་ཙམ་ཡོད་ཀྱིས་སོང་ལ་དགེ་སློང་རྣམས་ལ་ཁྱེད་ཅག་ལས།
en: “More than a hundred yojanas, Ānanda. Go and give this order to the monks:

source: གང་དང་གང་སང་གྲོང་ཁྱེར་སློ་མ་ལྟ་བུར་སོང་ནས་ཟས་ཟ་བར་སྤྲོ་བས་ཚུལ་ཤིང་ལོང་ཤིག་ཅེས་བསྒོ་ཤིག །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལས་མཉན་ནས་ཚུལ་ཤིང་བླངས་ཏེ།
en: ‘Those who, among you, will go to the city of Sūrpāraka and have a meal there tomorrow should take a counting stick.’ ” “Certainly, O Honored One,” replied the venerable Ānanda, and he took the counting sticks and sat down before the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་པ་དང་། བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་ཚུལ་ཤིང་བླངས་སོ།
en: The Blessed One and the monks who were the most venerable of the elders took counting sticks.

source: །དེའི་ཚེ་ཡུལ་ཆུ་མིག་ཅན་ན་གནས་པའི་གནས་བརྟན་ཚེ་དང་ལྡན་པ་གང་པོ་ཤེས་རབ་ཀྱིས་རྣམ་པར་གྲོལ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་ཏེ་འདུག་པར་གྱུར་པ་དེས་ཀྱང་ཚུལ་ཤིང་བླང་བར་བརྩམས་པ་དང་། དེ་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་སླར་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: At that time, the venerable elder Pūrṇa, who was an elder from Kuṇḍopadāna and had been liberated through wisdom, was sitting in the assembly. When the venerable elder Pūrṇa also tried to take a counting stick, the venerable Ānanda spoke this verse to him:

source: ཚེ་དང་ལྡན་པ་ཟན་འདི་ནི།
en: “Venerable one, this meal is not a meal

source: །ཀོ་ས་ལ་བདག་པོའི་ཕོ་བྲང་ངམ།
en: In the court of the king of Kosala,

source: །རབ་སྦྱིན་ཁྱིམ་དང་རི་དགས་ཀྱི།
en: The house of Sudatta,

source: །ཁྱིམ་གྱི་ཟས་ཀྱང་མ་ལགས་སོ།
en: Or the house of Mṛgāra.

source: །གྲོང་ཁྱེར་སློ་མ་ཞེས་བྱ་བ།
en: “We are going to a city called Sūrpāraka,

source: །དཔག་ཚད་བརྒྱ་ལྷག་མཆིས་པ་དེར།
en: More than a hundred yojanas distant from here,

source: །རྫུ་འཕྲུལ་གྱིས་ནི་བཞུད་འཚལ་བས།
en: With our magical power.

source: །གང་པོ་ཁྱོད་ནི་མ་གསུང་བཞུགས།
en: Pūrṇa, remain here silently.”

source: །དེ་ཤེས་རབ་ཀྱིས་རྣམ་པར་གྲོལ་བ་ཡིན་གྱི།
en: Although the venerable elder Pūrṇa had been liberated through wisdom, he had not attained magical power.

source: དེས་རྫུ་འཕྲུལ་མ་བསྐྱེད་པས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ་གང་གི་ཕྱིར་བདག་གིས་ཉོན་མོངས་པའི་ཚོགས་མཐའ་དག་བཙལ་ཅིང་བོར་ལ་སྤངས་ཤིང་སོ་སོར་སྤངས་ན།
en: Therefore he asked himself, “Why am I disheartened by lack of magical power even like that of the non-Buddhist ascetics when I have searched for the whole collection of defilements within myself, discarded all the defilements, abandoned them, and driven them away?” The venerable elder Pūrṇa exerted his vigor and gave rise to magical power.

source: བདག་མུ་སྟེགས་ཅན་དང་ཐུན་མོང་བའི་རྫུ་འཕྲུལ་ལ་སྒྱིད་ལུག་གམ་སྙམ་ནས་དེས་བརྩོན་འགྲུས་ལ་གནས་ཏེ་རྫུ་འཕྲུལ་བསྐྱེད་པས་ཇི་སྲིད་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་གནས་བརྟན་གསུམ་པ་ལ་ཚུལ་ཤིང་མ་བྱིན་པ་དེའི་བར་དུ་དེས་ལག་པ་གླང་པོ་ཆེའི་སྣ་ལྟ་བུ་བརྐྱང་ནས་ཚུལ་ཤིང་བླངས་ཏེ། དེ་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: He stretched his arm, which was like the trunk of an elephant, and took a counting stick before the venerable Ānanda passed a counting stick to a third elder, and the venerable elder Pūrṇa spoke this verse:

source: གཽ་ཏ་མ་འདི་ན་མངོན་ཤེས་དྲུག་པོ་ཉིད།
en: “O Gautama, in this world, the six sorts of supernormal knowledge

source: །གྲགས་པ་དང་ནི་ཐོས་པས་འཐོབ་མིན་ལ།
en: Are not attained by fame, learning, Various types of military force,

source: །ཚན་གྱི་ཡོན་ཏན་རྣམས་དང་ངག་དང་ནི། །ཡིད་སྨོན་ཆེན་པོས་ཀྱང་ནི་མ་ཡིན་གྱི།
en: Words, or a great wish.

source: །བདག་འདྲ་ཡོངས་སུ་རྟོག་པར་བྱེད་པ་རྣམས།
en: “Those who realize as I do,

source: །རྒ་བས་དར་ཡལ་གྱུར་ཀྱང་ཞི་བ་དང་། །ཚུལ་ཁྲིམས་ལྷག་མཐོང་སྟོབས་དང་བསམ་གཏན་སྟོབས། །རྣམ་པ་དུ་མས་མངོན་ཤེས་དྲུག་ལྡན་འགྱུར།
en: Even if their youth has been diminished by old age, Become endowed with the six sorts of supernormal knowledge By the power of tranquility, moral conduct, insight, and the various powers of dhyāna.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་ནི་ངའི་དགེ་སློང་རྣམས་ཀྱི་མཆོག་ཡིན་ཏེ།
en: On that occasion the Blessed One said to the monks, “Monks, this is the best of my monks, the best of my disciples for taking a counting stick for offerings.

source: ངའི་ཉན་ཐོས་མཆོད་པའི་ཚུལ་ཤིང་བླང་པ་ལ་དང་པོ་ཚུལ་ཤིང་ལེན་པ་རྣམས་ཀྱི་ནང་ན་འདི་ལྟ་སྟེ་ཡུལ་ཆུ་མིག་ཅན་ན་གནས་པའི་གནས་བརྟན་གང་པོ་མཆོག་ཡིན་ནོ།
en: The elder Pūrṇa, who is an elder from Kuṇḍopadāna, is the best of those who take a counting stick.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་སོང་ལ་དགེ་སློང་རྣམས་ལ་ངས་དགེ་སློང་དག་ཁྱེད་ཀྱིས་དགེ་བ་མི་སྤྱོམས་པ་དང་། སྡིག་པ་མི་བཅབ་པར་གནས་པར་བྱའོ་ཞེས་བཤད་མོད་ཀྱི། འོན་ཀྱང་གྲོང་ཁྱེར་དེ་ན་མུ་སྟེགས་པ་རྣམས་གནས་པས་ཁྱེད་ལས་གང་གིས་རྫུ་འཕྲུལ་གང་ཐོབ་པ་དེ་དེས་གྲོང་ཁྱེར་སློ་མ་ལྟ་བུར་སོང་ལ་ཟན་བཟའ་བར་བྱའོ་ཞེས་སྒོ་ཤིག །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལས་མཉན་ནས་དགེ་སློང་རྣམས་ལ་སྨྲས་པ།
en: Then the Blessed One instructed the venerable Ānanda, “Ānanda, go and say to the monks, ‘Though I have said, “Monks, you should live not displaying your virtue and not hiding your evil,” those among you who have attained magical power should go by means of that power to the city of Sūrpāraka and have a meal, because there are non-Buddhist ascetics in the city.’ ”

source: ཚེ་དང་ལྡན་པ་དག་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་ངས་དགེ་སློང་རྣམས་ཀྱིས་དགེ་བ་མི་སྤྱོམས་པ་དང་། སྡིག་པ་མི་བཅབ་པར་གནས་པར་བྱའོ། །ཞེས་བཤད་མོད་ཀྱི་ཞེས་བྱ་བ་ནས་སོང་ལ་ཟན་བཟའ་བར་བྱའོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “Certainly, O Honored One,” replied the venerable Ānanda to the Blessed One, and he said to the monks, “Venerables, the Blessed One said, ‘Though I have said, “Monks, you should live not displaying your virtue and not hiding your evil,” . . . because there are non-Buddhist ascetics in the city.’ ”

source: །རྒྱལ་པོས་གྲོང་ཁྱེར་སློ་མ་ལྟ་བུ་རྡོ་བ་དང་གསེག་མ་དང་གྱོ་མོ་རྣམས་སེལ་དུ་བཅུག་སྟེ། ཙན་དན་གྱི་ཆུས་ཆག་ཆག་བཏབ་དྲི་ཞིམ་པོའི་པོག་ཕོར་སྣ་ཚོགས་བཤམས། དར་གྱི་ཆུན་འཕྱང་མང་པོ་དཔྱངས།
en: The king had beautified the city of Sūrpāraka by removing stones, pebbles, and gravel, sprinkling sandalwood water, setting out sweet-smelling censers, hanging many silk tassels, and scattering flowers around the city.

source: མེ་ཏོག་སྣ་ཚོགས་ཆལ་བར་བཀྲམ་སྟེ་དགའ་དགའ་ལྟར་བྱས་ཏེ་གྲོང་ཁྱེར་སློ་མ་ལྟ་བུ་ལ་སྒོ་བཅྭ་བརྒྱད་ཡོད་ལ་རྒྱལ་པོ་དེ་ལ་ཡང་བུ་བཅུ་བདུན་ཡོད་དེ།
en: There were eighteen gates around the city of Sūrpāraka, and the king had seventeen sons.

source: གྲོང་ཁྱེར་གྱི་སྒོ་རེར་སོ་སོར་རྒྱལ་པོའི་བུ་རྣམས་འབྱོར་པ་མཆོག་དང་བཀོད་དོ།
en: At each surrounding gate a prince stood with the highest majesty.

source: །སྒོ་ཆེན་པོར་ནི་སློ་མ་ལྟ་བུའི་བདག་པོའི་རྒྱལ་པོ་རྒྱལ་པོའི་འབྱོར་པ་ཆེན་པོ་དང་ཚེ་དང་ལྡན་པ་གང་པོ་དང་ཤིང་གི་རྣ་ཆ་ཅན་དང་རྒྱ་སྐྱེགས་ཀྱི་རྣ་ཆ་ཅན་དང་ཞ་ཉེའི་རྣ་ཆ་ཅན་འདུག་གོ།
en: At the largest gate stood the king, the ruler of Sūrpāraka, with the great majesty of kings, together with the venerable Pūrṇa, Dārukarṇin, Stavakarṇin, and Trapukarṇin.

source: །ཇི་ཙམ་ན་ལོ་མ་འདྲིམ་པ་དང་། ཤང་ཙེ་འདྲིམ་པ་དང་སྣོད་སྤྱད་འདྲིམ་པ་དག་རྫུ་འཕྲུལ་གྱིས་ལྷགས་པ་རྒྱལ་པོས་མཐོང་ནས་སྨྲས་པ། ཅི་བཙུན་པ་གང་པོ་བཅོམ་ལྡན་འདས་གཤེགས་སམ་དེས་སྨྲས་པ།
en: The king then saw those handing out leaves, those handing out grass, and those handing out receptacles coming by means of their magical power and asked, “Reverend Pūrṇa, is the Blessed One coming?”

source: འདི་དག་ནི་ལོ་མ་འདྲིམ་པ་དང་། ཤང་ཙེ་འདྲིམ་པ་དང་། སྣོད་སྤྱད་འདྲིམ་པ་ལགས་ཏེ། བཅོམ་ལྡན་འདས་མ་ལགས་སོ།
en: Pūrṇa replied, “This is not the Blessed One but rather those handing out leaves, those handing out grass, and those handing out receptacles.”

source: །ཇི་ཙམ་ན་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་བསམ་གཏན་ལ་སྙོམས་པར་ཞུགས་པ་རྣམ་པ་དུ་མས་ལྷགས་པ་དང་རྒྱལ་པོས་ཡང་དྲིས་པ། ཅི་བཙུན་པ་གང་པོ་བཅོམ་ལྡན་འདས་གཤེགས་སམ།
en: At that time the monks who were the most venerable of the elders came by practicing dhyāna, and the king again asked, “Reverend Pūrṇa, is the Blessed One coming?”

source: མ་ལགས་ཏེ་འདི་ནི་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་བསམ་གཏན་ལ་སྙོམས་པར་ཞུགས་པ་རྣམ་པ་དུ་མས་ལྷགས་པ་ལགས་སོ།
en: “They are the monks who are the most venerable of the elders who have come by practicing dhyāna.”

source: །དེ་ནས་དགེ་བསྙེན་ཞིག་གིས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: A lay brother then spoke this verse:

source: ཁ་ཅིག་སེང་གེ་སྟག་དང་གླང་པོ་ཆེ་རྟ་ཀླུ་དང་ཁྱུ་མཆོག་བཟང་པོ་བཅིབས།
en: “Some come riding lions, tigers, elephants, horses, nāgas, or bulls;

source: །ཁ་ཅིག་རིན་ཆེན་གཞལ་མེད་ཁང་དང་རི་དང་ཤིང་མཛེས་ཤིང་རྟ་འབར་ལ་རྟེན།
en: Some come seated on heavenly vehicles made from jewels, mountains, trees, or beautiful chariots;

source: །གཞན་དག་ནམ་མཁའི་ངོས་ལས་ཆུ་འཛིན་གློག་གི་ཕྲེང་བས་བརྒྱན་པ་ལྟ་བུར་ནི།
en: And others come through the sky, like clouds adorned by garlands of lightning, joyfully,

source: །རབ་ཏུ་དགྱེས་བཞིན་ལྷ་ཡི་ཕོ་བྲང་ལྟ་བུར་རྫུ་འཕྲུལ་དག་གིས་གཤེགས་པར་བརྩོན།
en: As if going to the palace of the gods, by means of magical power.

source: །ཁ་ཅིག་ས་བརྟོལ་གྱེན་དུ་འབྱུང་།
en: “Some appear on the ground, breaking through the surface of the earth,

source: །ཁ་ཅིག་ནམ་མཁའི་དཀྱིལ་ནས་འབབ།
en: Some descend from the center of the sky,

source: །ཁ་ཅིག་སྟན་ལས་སྤྲུལ་པར་བྱེད།
en: And some emerge from their seats.

source: །རྫུ་འཕྲུལ་ལྡན་པའི་མཐུ་ལ་ལྟོས།
en: Look at the ability of those with magical power.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གཙུག་ལག་ཁང་གི་ཕྱི་རོལ་དུ་ཞབས་གཉིས་བཀྲུས་ཏེ། གཙུག་ལག་ཁང་དུ་ཞུགས་ནས་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་ཏེ། སྐུ་དྲང་པོར་བསྲང་ནས་དགོངས་པ་མངོན་དུ་ཕྱོགས་པར་བཞག་གོ།
en: Then the Blessed One washed his feet outside the monastery, entered inside, sat on the prepared seat, stretched his back, and focused his mind on a point in front of himself.

source: །ཇི་ཙམ་ན་བཅོམ་ལྡན་འདས་ཀྱིས་མངོན་པར་འདུ་བྱེད་པ་དང་བཅས་པའི་ཞབས་ཀྱིས་དྲི་གཙང་ཁང་དུ་བཞག་པ་ནས་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་གྱུར་ཏེ།
en: When the Blessed One put his foot down with a specific intention in the perfume chamber, the great earth quaked in six ways.

source: ས་ཆེན་པོ་འདི་གཡོས། རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས་སོ། །ཆེམ་ཆེམ།
en: This great earth quaked, quaked furiously, and quaked absolutely furiously.

source: རབ་ཏུ་ཆེམ་ཆེམ། ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ཆེམ་སྟེ།
en: It roared, roared furiously, and roared absolutely furiously.

source: ཤར་ཕྱོགས་མཐོ་ན་ནུབ་ཕྱོགས་དམའ།
en: When the eastern side rose, the western side sank.

source: ནུབ་ཕྱོགས་མཐོ་ན་ཤར་ཕྱོགས་དམའ།
en: When the western side rose, the eastern side sank.

source: ལྷོ་ཕྱོགས་མཐོ་ན་བྱང་ཕྱོགས་དམའ།
en: When the southern side rose, the northern side sank.

source: བྱང་ཕྱོགས་མཐོ་ན་ལྷོ་ཕྱོགས་དམའ།
en: When the northern side rose, the southern side sank.

source: མཐའ་མཐོ་ན་དབུས་དམའ།
en: When the periphery rose, the middle sank.

source: དབུས་མཐོ་ན་མཐའ་དམའོ།
en: When the middle rose, the periphery sank.

source: །རྒྱལ་པོས་ཚེ་དང་ལྡན་པ་གང་པོ་ལ་དྲིས་པ། འཕགས་པ་གང་པོ་འདི་ཅི་ལགས། དེས་སྨྲས་པ།
en: The king asked Pūrṇa, “Noble one Pūrṇa, what is this?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་མངོན་པར་འདུ་བྱེད་པ་དང་བཅས་པའི་ཞབས་ཀྱིས་དྲི་གཙང་ཁང་དུ་བཞག་པ་དེས་ན་ས་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་གྱུར་པ་ལགས་སོ།
en: Pūrṇa answered, “Because the Blessed One put his foot down with a specific intention in the perfume chamber, the great earth quaked in six ways.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསེར་གྱི་འོད་ཟེར་གྱི་ཁ་དོག་ལྟ་བུའི་འོད་བཀྱེ་སྟེ། དེས་འཛམ་བུའི་གླིང་གསེར་ཞུན་མ་ལྟ་བུར་སྣང་བར་གྱུར་ཏོ།
en: The Blessed One then emanated a ray of light colored like the radiance of gold, by which the continent of Jambu blazed like molten gold.

source: །ཡང་རྒྱལ་པོ་ངོ་མཚར་དུ་གྱུར་པའི་མིག་ཕྱེ་ནས་དྲིས་པ། འཕགས་པ་གང་པོ་འདི་ཅི་ལགས།
en: Again the king stared in surprise and asked, “Noble one Pūrṇa, what is this?”

source: དེས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་བཅོམ་ལྡན་འདས་ཀྱིས་གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་འོད་ཟེར་བཀྱེ་བ་ལགས་སོ།། །འདུལ་བ་གཞི། བམ་པོ་ཉི་ཤུ་ལྔ་པ།
en: Pūrṇa answered, “Great King, the Blessed One emanated a ray of light colored like the radiance of gold.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དུལ་བ་འཁོར་དུལ་བ། ཞི་བ་འཁོར་ཞི་བ་དགྲ་བཅོམ་པ་ལྔ་བརྒྱ་དང་ཐབས་ཅིག་ཏུ་སློ་མ་ལྟ་བུར་གཤེགས་སོ།
en: The Blessed One then went to Sūrpāraka together with five hundred arhats, himself tamed and his assembly tamed, himself pacified and his assembly pacified.

source: །དེ་ནས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ན་གནས་པའི་ལྷ་དེས་བ་ཀུ་ལའི་ཡལ་ག་ཞིག་བླངས་ཏེ།
en: A god who lived in the Jetavana followed the Blessed One, holding a branch of vakula with which he provided shade for him.

source: བཅོམ་ལྡན་འདས་ལ་གྲིབ་མ་བྱེད་ཅིང་རྗེས་བཞིན་རྗེས་བཞིན་དུ་སོང་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་དེ་དང་མཐུན་པའི་འཕགས་པའི་བདེན་པ་བཞི་རྟོགས་པར་འགྱུར་བའི་ཆོས་བཤད་པ་མཛད་དེ།
en: The Blessed One knew the god’s thinking, proclivity, disposition, and nature, preached the Dharma that was appropriate for him, and caused him to penetrate the four truths of the noble ones.

source: ཐོས་ནས་ལྷ་དེས་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་པར་གྱུར་ཏོ།
en: When the god had heard the Dharma, he leveled the twenty high peaks of the mountain chain of the false view of individuality with the vajra of knowledge and actualized the fruit of stream-entry.

source: །ཇི་ཙམ་ན་ཕྱོགས་གཞན་ཞིག་ན་ཡུགས་ས་མོ་ལྔ་བརྒྱ་ཙམ་གནས་པ་དེ་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་བཅུ་རྩ་གཉིས་ཀྱིས་ཀུན་ནས་བརྒྱན་པ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་བཅུས་མཛེས་པར་བྱས་པ། འོད་འདོམ་གང་གིས་བརྒྱན་པ། ཉི་མ་སྟོང་བས་ལྷག་པའི་འོད་མངའ་བ། རིན་པོ་ཆེའི་རི་བོ་འགྲོ་བ་ལྟ་བུར་ཀུན་ནས་བཟང་བར་མཐོང་ངོ་།
en: There then lived in another place about five hundred widows, and they saw the Blessed One, who was fully ornamented with the thirty-two marks of a great man, illuminated by the eighty minor marks, ornamented with a fathom-wide halo, and beautiful like a moving mountain of jewels whose light surpasses a thousand suns.

source: །མཐོང་མ་ཐག་ཏུ་ཡང་དེ་རྣམས་བཅོམ་ལྡན་འདས་ལ་སེམས་དང་བ་ཆེན་པོ་སྐྱེས་སོ།
en: As soon as the five hundred widows saw him, great faith in the Blessed One arose in them.

source: །འདི་ནི་ཆོས་ཉིད་ཡིན་ཏེ། ཇི་ལྟར་དགེ་བའི་རྩ་བ་བསགས་པའི་རྒྱུ་ཅན་གྱི་སེམས་ཅན་གྱིས་དང་པོར་སངས་རྒྱས་མཐོང་བ་ལྟར་ལོ་བཅུ་གཉིས་སུ་ཞི་གནས་ཀྱི་སེམས་གོམས་པར་བྱས་པ་དང་། བུ་མེད་པས་བུ་རྙེད་པ་དང་། དབུལ་པོས་གཏེར་མཐོང་བ་དང་། རྒྱལ་སྲིད་ལ་མངོན་པར་དགའ་བ་རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་བ་ནི་དེ་ལྟར་ཉམས་དགའ་བ་སྐྱེད་པ་མ་ཡིན་ནོ།
en: It is commonplace that when beings who possess the cause of having accumulated roots of merit look at the Buddha for the first time, they experience far greater pleasure than that of those who have practiced tranquility of mind for a dozen years, those who gain a son after having been childless, those who look upon treasure after having been poor, or those who are anointed as king after having longed for kingship.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་ཀྱི་གདུལ་བའི་དུས་ལ་གཟིགས་ནས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ།
en: After that, the Blessed One knew that it was the right time to train the widows, and sat on the seat prepared for him in front of the community of monks.

source: །དེ་རྣམས་ཀྱིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: The women bowed low until their foreheads touched the feet of the Blessed One, and then they sat down to one side.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་ཞེས་བྱ་བ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: The Blessed One knew their thinking, proclivities, dispositions, and nature . . . and they actualized the fruit of stream-entry.

source: །དེ་རྣམས་ཀྱིས་བདེན་པ་མཐོང་ནས་ལན་གསུམ་དུ་ཆེད་དུ་བརྗོད་པས་ཆེད་དུ་བརྗོད་པ། བཙུན་པ་བདག་ཅག་ལ་འདི་ལྟ་བུ་ནི་མས་མ་བགྱིས་ཏེ་ཕས་མ་ལགས། རྒྱལ་པོས་མ་ལགས།
en: After seeing the four truths of the noble ones, they spoke an inspired utterance three times:

source: ལྷས་མ་ལགས། སྡུག་པས་མ་ལགས། རང་གི་སྐྱེ་བོ་དང་གཉེན་གྱི་ཚོགས་ཀྱིས་མ་ལགས། སྔོན་གྱི་འདས་པས་མ་ལགས། དགེ་སྦྱོང་དང་། བྲམ་ཟེས་མ་ལགས་པ་གང་ལགས་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཅག་ལ་མཛད་དེ།
en: “Honored One, what the Blessed One has done for us is what has never been done for us by our mothers, our fathers, a king, gods, our husbands, our kinsmen and relatives, ancestral spirits, śramaṇas, or brahmins.

source: ཁྲག་དང་མཆི་མའི་རྒྱ་མཚོ་ནི་བསྐམས། རུས་པའི་རི་བོ་ལས་ནི་བསྒྲལ། ངན་སོང་གི་སྒོ་ནི་བཀུམ། ཐར་པ་དང་མཐོ་རིས་ཀྱི་སྒོ་ནི་ཕྱེ་ནས་བདག་ཅག་ལྷ་དང་མི་རྣམས་སུ་ནི་བཀོད་དེ།
en: You have dried up the ocean of blood and tears, liberated us from the mountain of bones, shut the gate to inferior states of existence, opened the gates to liberation and heaven, and placed us among gods and humans.

source: བཙུན་པ་བདག་ཅག་འཕགས་སོ། །མངོན་པར་འཕགས་སོ།
en: O Honored One, we have been exalted, truly exalted!

source: །བདག་ཅག་བཅོམ་ལྡན་འདས་དང་། ཆོས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆི་ལགས་ཀྱིས། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཅག་དགེ་བསྙེན་དུ་གཟུང་དུ་གསོལ།
en: Since we seek refuge in the Blessed One, the Dharma, and the community of monks, may the Blessed One accept us as lay sisters.”

source: དེ་དག་སྟན་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཀྱེ་མ་བཅོམ་ལྡན་འདས་བདག་ཅག་ལ་ཅུང་ཟད་ཅིག་སྩོལ་ཅིག་དང་། དེ་ལ་བདག་ཅག་བགྱི་བ་དག་བགྱིའོ།
en: They rose from their seats, made the gesture of supplication to the Blessed One, and implored the Blessed One, “O Blessed One, please give us something to worship.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱིས་དབུ་སྐྲ་དང་སེན་མོ་བྲེགས་ཏེ་བྱིན་ནོ།
en: The Blessed One then cut off his hair and nails by means of his magical power and gave his hair and nails to the widows.

source: །དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་དབུ་སྐྲ་དང་སེན་མོའི་མཆོད་རྟེན་ཞིག་བརྩིགས་སོ།
en: They built a stūpa for the hair and nails of the Blessed One.

source: །དེ་ནས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ན་གནས་པའི་ལྷ་གང་ཡིན་པ་དེས་མཆོད་རྟེན་དེའི་འཁོར་སར་བ་ཀུ་ལའི་ཡལ་ག་དེ་བསྐྱེད་དེ། བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ནི་མཆོད་རྟེན་འདི་ལ་བགྱི་བ་བགྱིད་ཅིང་མཆིས་སོ་ཞེས་དེ་དེ་ཉིད་ན་གནས་སོ།
en: After that, the god who lived in the Jetavana planted a vakula tree along the stūpa’s circumambulatory path, and then the god who lived in the Jetavana said to the Blessed One, “Blessed One, I will stay here, worshiping this stūpa.”

source: །དེ་ལ་ཁ་ཅིག་གིས་ནི་ཡུགས་ས་མོའི་མཆོད་རྟེན་ནོ་ཞེས་བྱ་བར་ཤེས་སོ།
en: The god who lived in the Jetavana stayed there.

source: །ཁ་ཅིག་གིས་ནི་བ་ཀུ་ལའི་འཁོར་ས་ཞེས་བྱ་བར་ཤེས་ཏེ།
en: Some people named the place the widows’ stūpa, and other people named it the circumambulatory path of the vakula.

source: མཆོད་རྟེན་ལ་ཕྱག་བྱེད་པའི་དགེ་སློང་དག་ད་དུང་ཡང་ཕྱག་བྱེད་དོ།
en: Monks who worship the stūpa worship the place even now.

source: །བཅོམ་ལྡན་འདས་གཤེགས་པ་དང་། ཇི་ཙམ་ན་བསྟི་གནས་གཞན་ཞིག་ན་དྲང་སྲོང་ལྔ་བརྒྱ་གནས་ཏེ།
en: The Blessed One then departed. At that time, there lived five hundred ṛṣis in a hermitage.

source: དེ་དག་གི་བསྟི་གནས་དེ་ནི་མེ་ཏོག་དང་འབྲས་བུ་དང་ཆུ་ཕུན་སུམ་ཚོགས་པས་དེ་དག་དེས་རྒྱགས་ནས་ཅི་ཡང་མི་སེམས་སོ།
en: Since the hermitage was abundant in flowers, fruits, and water, the ṛṣis were intoxicated with those things and were without worries. The Blessed One then knew that it was the right time to train the five hundred ṛṣis and went to the hermitage.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་ཀྱི་གདུལ་བའི་དུས་ལ་གཟིགས་ནས་བསྟི་གནས་དེར་གཤེགས་ཏེ་བྱོན་པ་དང་། རྫུ་འཕྲུལ་གྱིས་བསྟི་གནས་དེའི་མེ་ཏོག་དང་འབྲས་བུ་ནི་བརླག །ཆུ་ནི་བསྐམས། ནེའུ་གསིང་རྣམས་ནི་སློགས། འདུག་གནས་དག་ནི་བརྟིབ་བོ།
en: When the Blessed One arrived, with his magical power he destroyed the flowers and fruits of the hermitage, dried up the water, dug up the meadow, and smashed the residence to pieces.

source: །དེ་ནས་དྲང་སྲོང་དེ་དག་ལག་པ་འགྲམ་པ་ལ་གཏད་ནས་སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག་གོ།
en: The ṛṣis were then plunged into grief, resting their cheeks on their hands.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཅིའི་ཕྱིར་སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག །དེ་རྣམས་ཀྱིས་གསོལ་པ།
en: The Blessed One asked, “Why are you plunged into grief?”

source: བཅོམ་ལྡན་འདས་བསོད་ནམས་ཀྱི་ཞིང་རྐང་གཉིས་ཁྱེད་འདིར་གཤེགས་ནས་བདག་ཅག་ནི་གནས་སྐབས་འདི་འདྲ་བར་གྱུར་ཏོ།
en: “Blessed One,” they replied, “after you, a human field of merit, came here, we were placed in a grievous situation.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དྲང་སྲོང་དག་བསྟི་གནས་མེ་ཏོག་དང་འབྲས་བུ་དང་ཆུ་ཕུན་སུམ་ཚོགས་པ་ཅི་སྟེ་མ་རུང་།
en: The Blessed One then asked, “Ṛṣis, why was the hermitage, which was abundant in flowers, fruits, and water, ruined?

source: ཇི་སྔོན་གྱི་ཇི་ལྟ་བ་དེ་བཞིན་དུ་བྱའམ།
en: Shall I make the hermitage as it was before?”

source: བཅོམ་ལྡན་འདས་མཛད་དུ་གསོལ།
en: “Blessed One, please do so.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྫུ་འཕྲུལ་བརྟུལ་བ་དང་སྔོན་གྱི་ཇི་ལྟ་བ་བཞིན་དུ་གྱུར་ཏོ།
en: The Blessed One then ceased his magical power, and the hermitage became as it had been before.

source: །དེ་ནས་དེ་དག་མཆོག་ཏུ་ཡ་མཚན་དུ་གྱུར་ནས། བཅོམ་ལྡན་འདས་ལ་སེམས་མངོན་པར་དད་པ་བསྐྱེད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་ལྔ་བརྒྱ་པོ་དེ་དག་གི་བསམ་པ་དང་བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་དེ་དང་མཐུན་པའི་ཆོས་བཤད་པ་མཛད་དེ།
en: Thus, the five hundred ṛṣis were very much astonished, and their minds were filled with faith in the Blessed One. The Blessed One knew their thinking, proclivities, dispositions, and natures, and preached the Dharma that was appropriate for them.

source: དེ་ཐོས་ནས་དེ་དག་གིས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ་རྫུ་འཕྲུལ་མངོན་པར་བསྒྲུབས་ནས།
en: When the five hundred ṛṣis had heard the Dharma, they actualized the fruit of a never-returner and achieved magical power.

source: དེ་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བདག་ཅག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་འཐོབ་པ་ལྟ་ན།
en: They then made the gesture of supplication to the Blessed One and said, “Honored One, we wish to go forth and be ordained monks in the well-taught Dharma and Vinaya.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བདག་ཅག་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་བགྱིའོ།
en: We will lead the pure life in the presence of the Blessed One.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བས་དགེ་སློང་དག་ཚུར་ཤོག་ཚངས་པར་སྤྱད་པ་སྤྱོད་ཅིག་ཅེས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པའི་མོད་ལ་སྐྲ་དང་ཁ་སྤུ་བྱི་བ་དང་སྣམ་སྦྱར་གྱོན་པར་གྱུར་ཏེ། ལག་ན་ལྷུང་བཟེད་དང་། བྱ་མ་བུམ་ཐོགས་པ་དང་། སྐྲ་དང་ཁ་སྤུ་ཞག་བདུན་སྐྱེས་པ་ཙམ་དང་། དགེ་སློང་བསྙེན་པར་རྫོགས་ནས་ལོ་བརྒྱ་ལོན་པའི་སྤྱོད་ལམ་ལྟ་བུར་གནས་པར་གྱུར་ཏོ།
en: Then the Blessed One, using the “Come, monk” formula of ordination, said, “Come, monks, lead the pure life.” As soon as the Blessed One said this, their hair fell out and they were clad in their outer robes, with but a week’s worth of hair and beards, their bowls and pitchers in their hands, standing like monks who had been ordained a hundred years earlier.

source: །དེ་བཞིན་གཤེགས་པས་ཚུར་ཤོག་བཀའ་སྩལ་པས།
en: Because the Tathāgata said “come,”

source: །སྐྲ་བྱི་སྣམ་སྦྱར་གྱོན་པའི་ལུས་ལྡན་ཞིང་།
en: Their hair fell out and they were clad in their outer robes,

source: །མོད་ལ་དབང་པོ་རབ་ཞིར་གནས་གྱུར་ཏེ།
en: Their faculties at once calmed,
